Hoverfly.Core.Tests/bin/Debug/eddy_capture_sabre_031719_sabre.json

{
  "data": {
    "pairs": [
      {
        "response": {
          "status": 200,
          "body": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<soap-env:Envelope xmlns:soap-env=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap-env:Header><eb:MessageHeader xmlns:eb=\"http://www.ebxml.org/namespaces/messageHeader\" eb:version=\"1.0\" soap-env:mustUnderstand=\"1\"><eb:From><eb:PartyId eb:type=\"URI\">hushaboom.webservices.sabre.com</eb:PartyId></eb:From><eb:To><eb:PartyId eb:type=\"URI\">concur.com</eb:PartyId></eb:To><eb:CPAId>6YB9</eb:CPAId><eb:ConversationId>C201903142001599190@concur.com</eb:ConversationId><eb:Service eb:type=\"sabreXML\">Session</eb:Service><eb:Action>SessionCreateRS</eb:Action><eb:MessageData><eb:MessageId>210651016364060232</eb:MessageId><eb:Timestamp>2019-03-18T00:27:16</eb:Timestamp><eb:RefToMessageId>mid:20190314-200159-2266@concur.com</eb:RefToMessageId></eb:MessageData></eb:MessageHeader><wsse:Security xmlns:wsse=\"http://schemas.xmlsoap.org/ws/2002/12/secext\"><wsse:BinarySecurityToken valueType=\"String\" EncodingType=\"wsse:Base64Binary\">Shared/IDL:IceSess\\/SessMgr:1\\.0.IDL/Common/!ICESMS\\/RESE!ICESMSLB\\/RES.LB!1552868836422!8181!13</wsse:BinarySecurityToken></wsse:Security></soap-env:Header><soap-env:Body><SessionCreateRS xmlns=\"http://www.opentravel.org/OTA/2002/11\" version=\"1\" status=\"Approved\">\t<ConversationId>C201903142001599190@concur.com</ConversationId></SessionCreateRS></soap-env:Body></soap-env:Envelope>",
          "encodedBody": false,
          "headers": {
            "Connection": [ "Keep-Alive" ],
            "Content-Type": [ "text/xml;charset=utf-8" ],
            "Date": [ "Mon, 18 Mar 2019 00:27:16 GMT" ],
            "Hoverfly": [ "Was-Here" ],
            "Server": [ "SWS" ],
            "Soapaction": [ "\"\"" ],
            "Transfer-Encoding": [ "chunked" ],
            "Vary": [ "Accept-Encoding" ]
          }
        },
        "request": {
          "path": { "exactMatch": "/websvc" },
          "method": { "exactMatch": "POST" },
          "destination": { "exactMatch": "webservices.havail.sabre.com" },
          "scheme": { "exactMatch": "https" },
          "query": { "exactMatch": "" },
          "body": { "exactMatch": "<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\">\r\n  <soap:Header>\r\n    <MessageHeader xmlns=\"http://www.ebxml.org/namespaces/messageHeader\">\r\n      <ConversationId>C201903142001599190@concur.com</ConversationId>\r\n      <From>\r\n        <PartyId>concur.com</PartyId>\r\n      </From>\r\n      <To>\r\n        <PartyId>webservices.sabre.com</PartyId>\r\n      </To>\r\n      <CPAId>6YB9</CPAId>\r\n      <ebi:Service ebi:type=\"sabreXML\" xmlns:ebi=\"http://www.ebxml.org/namespaces/messageHeader\">SessionCreate</ebi:Service>\r\n      <Action>SessionCreateRQ</Action>\r\n      <MessageData>\r\n        <MessageId>mid:20190314-200159-2266@concur.com</MessageId>\r\n        <Timestamp>2019-03-14T20:01:59</Timestamp>\r\n      </MessageData>\r\n    </MessageHeader>\r\n    <Security xmlns=\"http://schemas.xmlsoap.org/ws/2002/12/secext\">\r\n      <UsernameToken>\r\n        <Username>8888</Username>\r\n        <Password>CONCUR1</Password>\r\n        <Organization xmlns=\"\">6YB9</Organization>\r\n        <Domain xmlns=\"\">DEFAULT</Domain>\r\n      </UsernameToken>\r\n    </Security>\r\n  </soap:Header>\r\n  <soap:Body>\r\n    <SessionCreateRQ xmlns=\"http://www.opentravel.org/OTA/2002/11\">\r\n      <POS>\r\n        <Source PseudoCityCode=\"6YB9\" />\r\n      </POS>\r\n    </SessionCreateRQ>\r\n  </soap:Body>\r\n</soap:Envelope>" }
        }
      }
    ],
    "globalActions": { "delays": [] }
  },
  "meta": { "schemaVersion": "v4" }
}